БухЭксп/InformationRegisters/CW_СоставГруппУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СоставГруппУслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СоставГруппУслуг/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Константы.CW_КонтролироватьДублиУслугВГруппах.Получить() Тогда
		мУслуги 	= Новый Массив;
		Для Каждого Строка Из ЭтотОбъект Цикл
			мУслуги.Добавить(Строка.Услуга);
		КонецЦикла;
		
		ПроверитьДублиУслуг(мУслуги, ЭтотОбъект.Отбор.Владелец.Значение, ЭтотОбъект.Отбор.ГруппаУслуг.Значение, Отказ);
	Конецесли;
	
КонецПроцедуры

Процедура ПроверитьДублиУслуг(мУслуги, Владелец, ГруппаУслуг, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СоставГруппУслуг.Владелец КАК Владелец,
	               |	CW_СоставГруппУслуг.ГруппаУслуг КАК ГруппаУслуг,
	               |	CW_СоставГруппУслуг.Услуга КАК Услуга
	               |ИЗ
	               |	РегистрСведений.CW_СоставГруппУслуг КАК CW_СоставГруппУслуг
	               |ГДЕ
	               |	CW_СоставГруппУслуг.Услуга В(&мУслуги)
	               |	И CW_СоставГруппУслуг.Владелец = &Владелец
	               |	И CW_СоставГруппУслуг.ГруппаУслуг <> &ГруппаУслуг";
	
	Запрос.УстановитьПараметр("мУслуги", 		мУслуги);
	Запрос.УстановитьПараметр("Владелец", 		Владелец);
	Запрос.УстановитьПараметр("ГруппаУслуг", 	ГруппаУслуг);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ШаблонСообщения = "Услуга %1 уже нахоится в группе уcлуг %2";
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.Услуга, Выборка.ГруппаУслуг);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
